# PANDAS DATA MANAGEMENT

In [1]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

# DataFrame Copy
df_original = df.copy()

/Users/haticekar/Desktop/anaconda/anaconda3/envs/python_course/lib/python3.11/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

### Copy
Recall from the last lesson, when we filled in missing values for median salary.

Here let's make a new dataframe `df_altered` and only make changes to it.

In [2]:
#Create a new dataframe
df_altered = df_original
df_altered.loc[:5, "salary_year_avg"]

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64

In [7]:
#Let's fill in missing values with the median value.
#calculating median salary
median_salary = df_altered["salary_year_avg"].median()

# filling the missing values with the median salary()
df_altered["salary_year_avg"] = df_altered.loc[:5, "salary_year_avg"].fillna(median_salary)
df_altered["salary_year_avg"] = df_altered["salary_year_avg"].fillna(median_salary)
df_altered.loc[:5, "salary_year_avg"]

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

Well both the variables of `df_original` and `df_altered` are referencing the same DataFrame.

* Burada df_altered, df_original ile aynƒ± nesneye i≈üaret ediyor.
* Yani bellekte sadece tek bir DataFrame var ve iki deƒüi≈üken de ona bakƒ±yor.
* id(df_original) == id(df_altered) ‚Üí ‚úÖ True
#### ‚ùó Bu durumda biri deƒüi≈üirse diƒüeri de deƒüi≈üir!

In [8]:
print("ID of df_original: ", id(df_original))
print("ID of df_altered: ", id(df_altered))
print("Are the two dataframes the same?: ", id(df_original)==id(df_altered))

ID of df_original:  6286232592
ID of df_altered:  6286232592
Are the two dataframes the same?:  True

Instead we can use the .copy() method

- `copy()`: Copy a DataFrame.

* Burada .copy() sayesinde df_original ve df_altered farklƒ± kopyalar oldu.
* Artƒ±k her biri bellekte farklƒ± nesneler.
* id(df_original) == id(df_altered) ‚Üí ‚ùå False
#### ‚úÖ Bu durumda biri deƒüi≈üse bile diƒüeri etkilenmez!

In [9]:
df_original = df.copy()
df_altered = df_original.copy()

print("ID of df_original: ", id(df_original))
print("ID of df_altered: ", id(df_altered))
print("Are the two dataframes the same?: ", id(df_original)==id(df_altered))

ID of df_original:  4478265872
ID of df_altered:  13235523920
Are the two dataframes the same?:  False

### üìä Veri Kopyalama Y√∂ntemleri Kar≈üƒ±la≈ütƒ±rmasƒ±

| Atama ≈ûekli                        | Bellekte Aynƒ± Nesne mi? | `id()` Aynƒ± mƒ±? | Birinde Deƒüi≈üiklik Diƒüerini Etkiler mi? |
|-----------------------------------|--------------------------|------------------|------------------------------------------|
| `df_altered = df_original`        | ‚úÖ Evet                  | ‚úÖ Evet          | ‚úÖ Evet                                   |
| `df_altered = df_original.copy()` | ‚ùå Hayƒ±r                 | ‚ùå Hayƒ±r         | ‚ùå Hayƒ±r                                  |


### üîê √ñzet:
1. df_altered = df_original ‚Üí sadece referans kopyasƒ±dƒ±r (ikisi de aynƒ± yere bakar)
2. df_altered = df_original.copy() ‚Üí tam anlamƒ±yla yeni, baƒüƒ±msƒ±z bir kopyadƒ±r

In [10]:
#Now when we do this median salary
#Calculating median salary 
median_salary = df_altered["salary_year_avg"].median()

#filling the missing values with the median salary
df_altered["salary_year_avg"] = df_altered["salary_year_avg"].fillna(median_salary)
df_altered.loc[:5, "salary_year_avg"]

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [11]:
#the original dataframe 
df_original.loc[:5, "salary_year_avg"]

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64

* Now that we've created a copy of our data, we want to start our analysis. But if we have a large set of data we only want to take a subset of data to make it more manageable. We can use `sample()` to get a random sample of the data.
* Artƒ±k verilerimizin bir kopyasƒ±nƒ± olu≈üturduƒüumuza g√∂re, analizimize ba≈ülamak istiyoruz. Ancak b√ºy√ºk bir veri k√ºmemiz varsa, daha y√∂netilebilir hale getirmek i√ßin yalnƒ±zca bir veri alt k√ºmesi almak istiyoruz. Verilerden rastgele bir √∂rnek almak i√ßin `sample()` kullanabiliriz.

## Sample

### Notes

* `sample()`: Random sample of items.

### Examples

Let's get a random sample of the data. You could get a sample with a fixed row number.

üéØ Python'da (√∂zellikle Pandas i√ßinde) sƒ±k√ßa kullanƒ±lan sample() fonksiyonu, bir veri k√ºmesinden rastgele √∂rnek (sample) almak i√ßin kullanƒ±lƒ±r. √ñzellikle veri analizi, modelleme ve test i≈ülemlerinde √ßok i≈üine yarar.

### üìå `sample()` Fonksiyonunun √ñnemli Parametreleri

| Parametre      | A√ßƒ±klama                                                                 |
|----------------|--------------------------------------------------------------------------|
| `n`            | Ka√ß tane rastgele satƒ±r alƒ±nacaƒüƒ±                                        |
| `frac`         | Oran olarak satƒ±r alma (√∂rnek: `frac=0.2` ‚Üí veri setinin %20‚Äôsini alƒ±r) |
| `replace=True` | Aynƒ± satƒ±rƒ±n birden fazla kez se√ßilmesine izin verir (bootstrap i√ßin)   |
| `random_state` | Aynƒ± rastgele sonucu tekrar elde etmek i√ßin sabit bir sayƒ± verir        |

#### üéØ Ne i√ßin kullanƒ±lƒ±r?
1. Modelleme i√ßin eƒüitim/test seti olu≈üturmak
2. B√ºy√ºk veri k√ºmesinden k√º√ß√ºk bir √∂rnek g√∂rmek
3. Veri ke≈üfi (exploratory analysis) sƒ±rasƒ±nda rastgele satƒ±rlara bakmak
4. Bootstrapping y√∂ntemlerinde

In [14]:
df.sample(5)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
153868,Data Scientist,Insights Data Scientist,United Kingdom,via LinkedIn,Full-time,False,United Kingdom,2023-07-14 08:16:23,False,False,United Kingdom,None,NaN,NaN,YouView TV Limited,"['sql', 'python', 'github']","{'other': ['github'], 'programming': ['sql', '..."
21805,Senior Data Scientist,Senior Data Scientist,"Ahmedabad, Gujarat, India",via Indeed,Full-time,False,India,2023-05-31 13:13:38,False,False,India,None,NaN,NaN,Zymr,"['python', 'r', 'azure', 'databricks', 'aws', ...","{'analyst_tools': ['tableau'], 'cloud': ['azur..."
207769,Data Engineer,Big data engineer,"Missoula, MT",via Talent.com,Full-time,False,Sudan,2023-07-09 23:48:55,False,False,Sudan,None,NaN,NaN,Acxiom,"['sql', 'python', 'java', 'snowflake', 'looker']","{'analyst_tools': ['looker'], 'cloud': ['snowf..."
458146,Data Scientist,Data Scientist Staff,"Ciudad Ju√°rez, Chihuahua, Mexico",via BeBee,Full-time,False,Mexico,2023-12-22 14:09:58,False,False,Mexico,None,NaN,NaN,Johnson & Johnson,"['r', 'python', 'java']","{'programming': ['r', 'python', 'java']}"
725642,Data Analyst,Manager IT Big Data,"Tienen, Belgium",via BeBee Belgique,Full-time,False,Belgium,2023-11-02 21:33:22,True,False,Belgium,None,NaN,NaN,Colruyt Group,['chef'],{'other': ['chef']}

In [ ]:
#or you can randomly select a fraction of the data (e.g 10% of the rows), with or without replacement.
df.sample(frac=0.1, replace=False)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
304089,Data Scientist,Data Scientist,"Kolkata, West Bengal, India",via Trabajo.org,Full-time,False,India,2023-08-01 17:19:54,False,False,India,None,NaN,NaN,Agnik,None,None
727188,Data Scientist,Test my Python data science tool,Anywhere,via Upwork,Contractor and Temp work,True,"Texas, United States",2023-11-07 21:03:44,False,False,United States,hour,NaN,31.0,Upwork,"['python', 'go', 'excel', 'spreadsheet', 'zoom']","{'analyst_tools': ['excel', 'spreadsheet'], 'p..."
135710,Business Analyst,Business Development Analyst,"Athlone, County Westmeath, Ireland",via Trabajo.org,Full-time,False,Ireland,2023-04-09 08:21:52,False,False,Ireland,None,NaN,NaN,Pharmaforce Ireland Ltd,['excel'],{'analyst_tools': ['excel']}
451223,Senior Data Engineer,Senior Data Engineer Connectivity (f/m/x),"W√∂rth am Rhein, Germany",via WANE Jobs,Full-time,False,Germany,2023-05-29 14:15:13,True,False,Germany,None,NaN,NaN,Daimler Truck AG,None,None
260889,Data Scientist,Ing√©nieur Big data - datascientist F/H,"Bruz, France",via Jobijoba,Full-time,False,France,2023-06-06 07:21:49,False,False,France,None,NaN,NaN,Civils de la D√©fense,"['python', 'scala', 'spark']","{'libraries': ['spark'], 'programming': ['pyth..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
364675,Data Analyst,Data Analyst/ SQL Developer,"Bucharest, Romania",via Lucrezi.ro,Full-time,False,Romania,2023-01-28 00:10:03,True,False,Romania,None,NaN,NaN,Altimetrik Poland,"['python', 'sql', 'sql server', 'oracle']","{'cloud': ['oracle'], 'databases': ['sql serve..."
739875,Data Scientist,Mid-Senior Data Scientist x 2,Anywhere,via LinkedIn,Full-time,True,"Texas, United States",2023-08-09 21:03:27,False,False,United States,None,NaN,NaN,Mesmerise Group,"['python', 'azure', 'gcp', 'aws', 'pandas', 's...","{'cloud': ['azure', 'gcp', 'aws'], 'libraries'..."
369299,Data Analyst,HR Payroll and Data Analyst,Singapore,via Jobrapido.com,Full-time,False,Singapore,2023-11-08 23:49:08,False,False,Singapore,None,NaN,NaN,GATES INDUSTRIAL SINGAPORE PTE. LTD.,None,None
343412,Senior Data Scientist,Senior Data Scientist,United States,via California Jobs - Tarta.aiüå¥,Full-time,False,Sudan,2023-03-10 23:43:05,False,False,Sudan,None,NaN,NaN,Activision,"['python', 'java', 'sql', 'aws', 'gcp', 'azure...","{'cloud': ['aws', 'gcp', 'azure'], 'libraries'..."
680712,Data Scientist,Data Scientist,"New Delhi, Delhi, India",via LinkedIn,Full-time,False,India,2023-11-14 10:10:16,False,False,India,None,NaN,NaN,Sheru | Mega Job-A-Thon,"['sql', 'php', 'scala', 'java', 'c++', 'aws', ...","{'analyst_tools': ['tableau'], 'cloud': ['aws'..."

In [19]:
df.sample(n=5, random_state=42)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
502901,Senior Data Engineer,Senior Data Engineer,"St Paul, MN",via BeBee,Full-time,False,"Florida, United States",2023-12-17 11:09:06,False,False,United States,None,NaN,NaN,ManpowerGroup,"['sql', 'azure', 'git']","{'cloud': ['azure'], 'other': ['git'], 'progra..."
406337,Senior Data Scientist,Senior Analytics Engineer,"London, UK",via LinkedIn,Full-time,False,United Kingdom,2023-10-06 16:09:56,False,False,United Kingdom,None,NaN,NaN,Harnham,"['sql', 'python', 'bigquery', 'snowflake', 'lo...","{'analyst_tools': ['looker'], 'cloud': ['bigqu..."
659951,Data Engineer,Data Engineer,"Newcastle upon Tyne, UK",via Indeed,Full-time,False,United Kingdom,2023-09-06 10:11:25,True,False,United Kingdom,None,NaN,NaN,Morgan King,None,None
541593,Data Analyst,Data Analyst,Malta,via Trabajo.org,Full-time,False,Malta,2023-02-14 21:14:18,True,False,Malta,None,NaN,NaN,Konnekt,['jira'],{'async': ['jira']}
425158,Senior Data Engineer,Senior Data Engineer. Job in Amsterdam NBC4i Jobs,"Amsterdam, Netherlands",via NBC4i Jobs,Full-time,False,Netherlands,2023-06-19 16:34:30,True,False,Netherlands,None,NaN,NaN,Independent Recruiters,['python'],{'programming': ['python']}

* Python‚Äôda (√∂zellikle Pandas ile √ßalƒ±≈üƒ±rken) copy() fonksiyonu, bir DataFrame‚Äôin baƒüƒ±msƒ±z bir kopyasƒ±nƒ± olu≈üturmak i√ßin kullanƒ±lƒ±r.

## Ne zaman copy() kullanmalƒ±sƒ±n?
1. Veri √ºzerinde deƒüi≈üiklik yapmadan √∂nce orijinalini korumak istiyorsan
2. Eƒüitim ve test verisini ayƒ±rƒ±rken
3. Veri setini yeniden d√ºzenlemeden √∂nce yedek almak i√ßin

In [18]:
import pandas as pd

# Orijinal DataFrame
df_original = pd.DataFrame({
    'Name': ['Ali', 'Ay≈üe', 'Mehmet'],
    'Age': [25, 30, 22]
})

print("üîπ Orijinal DataFrame:")
print(df_original)

# 1. Durum: Sadece referans atamasƒ±
df_ref = df_original
df_ref['Age'] = df_ref['Age'] + 10

print("\nüî∏ Referansla kopyalandƒ±ktan sonra df_ref deƒüi≈ütirildi:")
print("df_original:")
print(df_original)  # Etkilendi!

# 2. Durum: Ger√ßek kopya
df_original = pd.DataFrame({
    'Name': ['Ali', 'Ay≈üe', 'Mehmet'],
    'Age': [25, 30, 22]
})

df_copy = df_original.copy()
df_copy['Age'] = df_copy['Age'] + 10

print("\n‚úÖ copy() ile kopyalandƒ±ktan sonra df_copy deƒüi≈ütirildi:")
print("df_original:")
print(df_original)  # Deƒüi≈ümedi!
print("df_copy:")
print(df_copy)      # Sadece df_copy deƒüi≈üti

üîπ Orijinal DataFrame:
     Name  Age
0     Ali   25
1    Ay≈üe   30
2  Mehmet   22

üî∏ Referansla kopyalandƒ±ktan sonra df_ref deƒüi≈ütirildi:
df_original:
     Name  Age
0     Ali   35
1    Ay≈üe   40
2  Mehmet   32

‚úÖ copy() ile kopyalandƒ±ktan sonra df_copy deƒüi≈ütirildi:
df_original:
     Name  Age
0     Ali   25
1    Ay≈üe   30
2  Mehmet   22
df_copy:
     Name  Age
0     Ali   35
1    Ay≈üe   40
2  Mehmet   32